#encoding = utf-8

import urlTest

def urlTestTest():
    # 没有地图的情况下，下载1,2,3
    # 有地图的情况下，下载1,2,3
    # 下载新地图，标号为10,132,123123323321321 成功
    # 下载新地图失败，重新下载
    urlTest.loadMap()

def testRoute():
    # 1_2:
    # input: 1 2      output: [1, 2]
    # 1 4             [1, 2, 4]
    # 4 1             [4,2,1]
    # 1 29            [1,2,4,5,8,10,11,14, 37,16,18,22,34,26,29]
    # 29 1
    # 14 24           [14,15,32,39,17,21,24]
    #
    # 2_2:
    # 19 7            [19,6,7]
    # 2 10            [2,5,19,6,7,8,10]
    # 1 21            超范围

def testAng():
    1_2:
    
